app/views/firms/index.html.erb

SELECT "firms".* FROM "firms"
---
<div class="firms-index">
    <% Firm.all.each do |firm| %>