app/helpers/profil_helper.rb

    def user_appointments(user_id)
        @current_appointments = []
        Appointment.all.each do |appointment|
---
SELECT "appointments".* FROM "appointments"