app/controllers/appointments_controller.rb

INSERT INTO "appointments" ("start_date", "is_confirmed", "is_paid", "firm_id", "lawyer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @appointment = Appointment.new(post_params)
        if @appointment.save

DELETE FROM "appointments" WHERE "appointments"."id" = $1  [["id", 372]]
SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 372], ["LIMIT", 1]]
---
    def destroy
        Appointment.find(params[:firm_id].to_i).destroy

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 351], ["LIMIT", 1]]
UPDATE "appointments" SET "is_confirmed" = $1, "updated_at" = $2 WHERE "appointments"."id" = $3  [["is_confirmed", true], ["updated_at", "2022-03-31 10:26:05.920794"], ["id", 351]]
UPDATE "appointments" SET "client_id" = $1, "updated_at" = $2 WHERE "appointments"."id" = $3  [["client_id", 1], ["updated_at", "2022-03-31 10:26:05.930951"], ["id", 351]]
UPDATE "appointments" SET "client_id" = $1, "updated_at" = $2 WHERE "appointments"."id" = $3  [["client_id", nil], ["updated_at", "2022-03-31 10:26:08.987149"], ["id", 351]]
---
    def update
        @appointment = Appointment.find(params[:id].to_i)
        @appointment.update(is_confirmed: !@appointment.is_confirmed)
        if @appointment.client_id == nil
            @appointment.update(client_id: current_user.id)
        else
            @appointment.update(client_id: nil)