app/controllers/firms_controller.rb

    def index
        if params[:zip_code].to_i == 0
            params[:zip_code] = 1
        end
        @zip_id = Departement.find_by(zip_code: params[:zip_code]).id
---
SELECT  "departements".* FROM "departements" WHERE "departements"."zip_code" = $1 LIMIT $2  [["zip_code", "01"], ["LIMIT", 1]]

    def show
        @lawyers = User.all
        @firm = Firm.find(params[:id])
        @law_types = LawTypesByFirm.find_by(firm_id: params[:id])
---
SELECT "users".* FROM "users"
SELECT  "firms".* FROM "firms" WHERE "firms"."id" = $1 LIMIT $2  [["id", 1645], ["LIMIT", 1]]
SELECT  "law_types_by_firms".* FROM "law_types_by_firms" WHERE "law_types_by_firms"."firm_id" = $1 LIMIT $2  [["firm_id", 1645], ["LIMIT", 1]]

    def create
        @firm = Firm.new(post_params)
        if @firm.save
---
INSERT INTO "firms" ("name", "address", "phone_number", "email", "departement_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"