app/views/application/_firm_list.html.erb

SELECT "firms".* FROM "firms"
---
<div class="firms-index">
    <% Firm.all.each do |firm| %>