app/views/application/_show_firm.html.erb

        <div class="my-rating">
          <h1><b><%= Firm.find(params[:id].to_i).name %>.</b></h1>
---
SELECT  "firms".* FROM "firms" WHERE "firms"."id" = $1 LIMIT $2  [["id", 1645], ["LIMIT", 1]]